## Pandas

### Create pandas series

In [2]:
import pandas as pd
import numpy as np

a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# information about series

print(a.dtype)
print(a.axes)
print(a.size)
print(a.ndim)

int64
[RangeIndex(start=0, stop=5, step=1)]
5
1

In [7]:
print(a.values)

[1 2 3 4 5]

In [8]:
# access to index with 'head' func

print(a.head(3))

0    1
1    2
2    3
dtype: int64

In [9]:
print(a.tail(3))

2    3
3    4
4    5
dtype: int64

### index naming

In [10]:
a = pd.Series([40, 27, 30, 37, 25], index = [1,3,5,7,9])
print(a)

1    40
3    27
5    30
7    37
9    25
dtype: int64

In [11]:
a = pd.Series([46, 40, 34, 30], index = ["a", "b", "c", "d"])
print(a)

a    46
b    40
c    34
d    30
dtype: int64

In [12]:
print(a["a": "c"])

a    46
b    40
c    34
dtype: int64

### join two series

In [14]:
a_1 = pd.Series([28, 24, 20, 13], index=["e", "f", "g", "h"])
b = pd.concat([a,a_1])
print(b)

a    46
b    40
c    34
d    30
e    28
f    24
g    20
h    13
dtype: int64

### element operations

In [15]:
a = np.array([1,2,3,4,5])
series = pd.Series(a)
print(series[1:3])

1    2
2    3
dtype: int32

In [16]:
# element questioning

a = pd.Series([1,2,3,4], index=["a","b", "c", "d"])
print("b" in a)

True

In [17]:
print("e" in a)

False

### Create dataframe with pandas

In [18]:
list_1 = [1,2,3,4,5]
data = pd.DataFrame(list_1, columns=["variable"])
print(data)

   variable
0         1
1         2
2         3
3         4
4         5

In [19]:
m = np.arange(1,10).reshape((3,3))
data = pd.DataFrame(m, columns=["var1", "var2", "var3"])
print(data)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [20]:
print(data["var1"])

0    1
1    4
2    7
Name: var1, dtype: int32

### Variable naming in dataframe

In [22]:
ls = np.arange(1,10).reshape((3,3))
df = pd.DataFrame(ls, columns=["var1", "var2", "var3"])
print(df)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [23]:
df.columns = ["valu1", "valu2", "value3"]
print(df)

   valu1  valu2  value3
0      1      2       3
1      4      5       6
2      7      8       9

### Dataframe transactions

In [25]:
df.drop(0, axis=0, inplace=True)
print(df)

   valu1  valu2  value3
1      4      5       6
2      7      8       9

In [27]:
df["var4"] = df["valu1"] * df["valu2"]
print(df)

   valu1  valu2  value3  var4
1      4      5       6    20
2      7      8       9    56

In [34]:
ls_1 = ["valu1", "valu2"]
df.drop(ls_1, axis=1)
print(df)

   valu1  valu2  value3  var4
1      4      5       6    20
2      7      8       9    56

### choose observation and variable: loc and iloc

In [36]:
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])

In [37]:
df.loc[0:5]

   var1  var2  var3
0    29     8    16
1    23    12    27
2    24    21    18
3     6    20    29
4    24     9    25
5    26    27    26

In [38]:
df.iloc[0:5]

   var1  var2  var3
0    29     8    16
1    23    12    27
2    24    21    18
3     6    20    29
4    24     9    25

In [41]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

   var1  var2
0    29     8
1    23    12
2    24    21
4    24     9
5    26    27
6    19    15
8    19    29
9    17    15

### join transactions

In [43]:
df1 = df + 20
jn = pd.concat([df1, df])
print(jn)

   var1  var2  var3
0    49    28    36
1    43    32    47
2    44    41    38
3    26    40    49
4    44    29    45
5    46    47    46
6    39    35    36
7    27    47    40
8    39    49    37
9    37    35    43
0    29     8    16
1    23    12    27
2    24    21    18
3     6    20    29
4    24     9    25
5    26    27    26
6    19    15    16
7     7    27    20
8    19    29    17
9    17    15    23

In [44]:
pd.concat([df1, df],ignore_index=True)

    var1  var2  var3
0     49    28    36
1     43    32    47
2     44    41    38
3     26    40    49
4     44    29    45
5     46    47    46
6     39    35    36
7     27    47    40
8     39    49    37
9     37    35    43
10    29     8    16
11    23    12    27
12    24    21    18
13     6    20    29
14    24     9    25
15    26    27    26
16    19    15    16
17     7    27    20
18    19    29    17
19    17    15    23

In [46]:
pd.concat([df1, df], join="inner") # does not take non-partners > 'join=inner'

   var1  var2  var3
0    49    28    36
1    43    32    47
2    44    41    38
3    26    40    49
4    44    29    45
5    46    47    46
6    39    35    36
7    27    47    40
8    39    49    37
9    37    35    43
0    29     8    16
1    23    12    27
2    24    21    18
3     6    20    29
4    24     9    25
5    26    27    26
6    19    15    16
7     7    27    20
8    19    29    17
9    17    15    23

### advanced join transaction

In [47]:
cs1 = pd.DataFrame({'worker': ['Ali', 'John', 'Maria'],
                   'group': ["accounting", "engineer", "IT"]})
cs2 = pd.DataFrame({'worker': ['Ali', 'John', 'Maria'],
                   'first_entrance': [2012, 2014, 2019]})
cs_whole = pd.merge(cs1, cs2)
print(cs_whole)

  worker       group  first_entrance
0    Ali  accounting            2012
1   John    engineer            2014
2  Maria          IT            2019

### Aggregation and Groupping

In [68]:
# basic aggregation functions:

import seaborn as sns # activate seaborn library
df = sns.load_dataset("planets") # prepared dataset

In [56]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning) # for remove 'future warning' 

avarage_value = df.mean()
print(avarage_value)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [57]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [58]:
# or single value
df["mass"].count()

513

In [59]:
df["mass"].min()

0.0036

In [60]:
df["mass"].max()

25.0

In [61]:
df["mass"].sum()

1353.37638

In [62]:
df["mass"].std()

3.8186166509616046

In [63]:
df["mass"].var()

14.58183312700122

In [64]:
all_func = df.describe()
print(all_func)

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [65]:
all_func = df.describe().T # raise legibility
print(all_func)

                 count         mean           std          min         25%  \
number          1035.0     1.785507      1.240976     1.000000     1.00000
orbital_period   992.0  2002.917596  26014.728304     0.090706     5.44254
mass             513.0     2.638161      3.818617     0.003600     0.22900
distance         808.0   264.069282    733.116493     1.350000    32.56000
year            1035.0  2009.070531      3.972567  1989.000000  2007.00000

                      50%       75%       max
number             1.0000     2.000       7.0
orbital_period    39.9795   526.005  730000.0
mass               1.2600     3.040      25.0
distance          55.2500   178.500    8500.0
year            2010.0000  2012.000    2014.0

In [66]:
# grouping operations > groupby() func.

df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                 'data': [10,36,52,47,76,42]},
                 columns=['groups', 'data'])


df.groupby("groups").mean()

        data
groups
A       28.5
B       56.0
C       47.0

In [69]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### Advanced Aggreagation Operations

In [70]:
# Aggregate() > batch method use 

df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                 'data': [10,36,52,47,76,42]},
                 columns=['groups', 'data'])

df.groupby('groups').aggregate(["min", np.median, max])

       data
        min median max
groups
A        10   28.5  47
B        36   56.0  76
C        42   47.0  52

In [71]:
#filter() > for complicated needs. 'func' operations

def filter_func(x):
    return x["data"].min() > 35

df.groupby("groups").filter(filter_func)

  groups  data
1      B    36
2      C    52
4      B    76
5      C    42

In [72]:
#transform() > for functional transformations use

df_a = df.iloc[:, 1:3]
df_a.transform(lambda x: x - x.mean())

        data
0 -33.833333
1  -7.833333
2   8.166667
3   3.166667
4  32.166667
5  -1.833333

In [73]:
#apply() 

df.apply(np.sum)

groups    ABCABC
data         263
dtype: object

### Pivot table structure

In [74]:
tit = sns.load_dataset("titanic")
df = tit.pivot_table("survived", index = 'sex', columns = 'class')
print(df)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [75]:
# instead of pivot table: groupby func

df = tit.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()
print(df)

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### reading data from external source

In [76]:
# to read file with 'txt' and 'csv' extension.
# df = pd.read_csv("example_csv.csv")
# df = pd.read_csv("flat_text.txt")


df = pd.read_csv("example.csv")
df.head()

  first_name last_name                              email  gender
0      Aland    Hannum                   ahannum0@ftc.gov    Male
1    Dee dee    Borsay              dborsay1@virginia.edu  Female
2      Pavel    Feeham               pfeeham2@typepad.com    Male
3       Even     Seson              eseson3@newyorker.com    Male
4         Bo  Rennicks  brennicks4@scientificamerican.com    Male

In [77]:
# for excel file
# df.read_excel("example.xlsx")